package Jar;

import java.util.ArrayDeque;
//<T> искаме този буркан да работи с всички типове
public class Jar<T> {
    private ArrayDeque<T> stack;
    //мястото, в което съхраняваме данните

//правим празен констуктор
    //public Jar()
        //целна на констуктора е да създаде нов буркан
        //в който искаме да имам стек, в който да съхраняваме данните
        //this.stack = stack;
        //само, че искаме стека да ние празен

    public Jar() {
        //нов буркан
        this.stack = new ArrayDeque<>();
    }

    //add -> трябва да приема елемнт и да го добявя в стека
    //(T element) .... за да мога да го добавя в моя буркан -> стека на буркана
    //трябва типа на данните, които ще съхрявам в стека трябва да са от тип <Т>
    //element -> елемента от тип Т го гращаме като променливата element
    public void add (T element) {
        this.stack.push(element);
    }

    //след като премахне елемента искаме да го връща и той ще е от тип Т
    public T remove() {
        return this.stack.pop();
    }
}
